In [3]:
import pandas as pd


df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
student_scores = {
    "John": {"Math": 90, "Science": 85, "English": 92},
    "Alice": {"Math": 95, "Science": 88, "English": 89},
    "Michael": {"Math": 82, "Science": 90, "English": 78}
}
myvar=pd.DataFrame(student_scores)
print(myvar)

         John  Alice  Michael
Math       90     95       82
Science    85     88       90
English    92     89       78

In [10]:
myvar.columns

Index(['John', 'Alice', 'Michael'], dtype='object')

In [13]:
marks={
    "Conrad": ["Math", "Science", "English" ],
    "Alice": ["Math", "Science", "English"]}
df1= pd.DataFrame(marks)
print(df1)

    Conrad    Alice
0     Math     Math
1  Science  Science
2  English  English

In [17]:
dict={
    "Monday":"2023-10-10",
    "Tuesday":"2022-10-10"}
var = pd.Series(dict)
print(var)

Monday     2023-10-10
Tuesday    2022-10-10
dtype: object

In [4]:
data = pd.read_csv("mine.csv")
data

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [11]:
#data.head() #Displays by default first 5
data.head(7)# displays 7

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0
5        60    102       127     300.0
6        60    110       136     374.0

In [12]:
#data.tail()
data.tail(7)

     Duration  Pulse  Maxpulse  Calories
162        45     95       130     270.0
163        45    100       140     280.9
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [23]:
#By default, it removes any row containing at least one NaN value, 
# but you can specify the axis and threshold to customize the behavior. 

clean_data = data.dropna()
print(clean_data)# Remove rows with NaN values
# clean_df = data.dropna(axis=1)  # Remove columns with NaN values
# clean_df = data.dropna(thresh=2)  # Remove rows with less than 2 non-NaN values

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [22]:
clean_df = data.fillna(0)  # Fill NaN values with 0
print(clean_df)
# clean_df = data.fillna({'column1': 0, 'column2': 'Unknown'})  # Fill NaN values in specific columns
# clean_df = data.fillna(method='ffill')  # Forward-fill NaN values
# clean_df = data.fillna(method='bfill')  # Backward-fill NaN values

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [ ]:
data = data.dropna()
#to remove wrong data

In [25]:
data['Calories'] = data['Calories'].astype(float)
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [27]:
data = data.drop_duplicates()

In [28]:
correlation_matrix = data.corr()
print(correlation_matrix)

          Duration     Pulse  Maxpulse  Calories
Duration  1.000000 -0.162098  0.003578  0.923053
Pulse    -0.162098  1.000000  0.787035  0.015301
Maxpulse  0.003578  0.787035  1.000000  0.195309
Calories  0.923053  0.015301  0.195309  1.000000

In [29]:
work = pd.read_csv("Work.csv")
work

     Name         city    age py-score
0    Emma      Kampala     23       90
1  Wilber        Mbale     26       75
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

In [32]:
work.head()

     Name         city  age py-score
0    Emma      Kampala   23       90
1  Wilber        Mbale   26       75
2   Robin         Gulu   25     mine
3   Tevor  Livingstone  NaN       89
4    Yeko       Tororo   20       94

In [35]:
work = data.dropna()
work

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[157 rows x 4 columns]

In [36]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 157 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  157 non-null    int64
 1   Pulse     157 non-null    int64
 2   Maxpulse  157 non-null    int64
 3   Calories  157 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 6.1 KB

In [43]:
# data['py-score'] = pd.to_numeric(data['py-score'], errors='coerce')
# data

In [41]:
data = data.drop_duplicates()
data

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[157 rows x 4 columns]

In [42]:
correlation_matrix = data.corr()
print(correlation_matrix)

          Duration     Pulse  Maxpulse  Calories
Duration  1.000000 -0.167770 -0.000501  0.923053
Pulse    -0.167770  1.000000  0.784994  0.015301
Maxpulse -0.000501  0.784994  1.000000  0.195309
Calories  0.923053  0.015301  0.195309  1.000000